In [1]:
import pandas as pd

In [2]:
%ls

2.1_pandas.ipynb
2.2_cleaning_and_data_manipulation.ipynb
2.3_combining_structuring_data.ipynb
2.4_aggregating_data.ipynb*
2.5_apis.ipynb
2.6_web_scraping.ipynb
data.pkl
tablita.csv
tablita.xlsx
tiburones.csv

In [203]:
df_t = pd.read_csv('tiburones.csv', sep=';')

In [204]:
df_t.head()

,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,...,Fatal (Y/N),Time,Species,Investigator or Source,pdf,href formula,href,Case Number,Case Number.1,original order
0,2023-07-03,2023.0,Unprovoked,USA,New York,"Beach 3, Robert Moses State Park, Suffolk County",Swimming,female,F,15,...,N,13h45,Sand tiger shark,"S.S. Curatolo- Wagemann, GSAFF",NaN,NaN,NaN,NaN,NaN,NaN
1,2023-03-17,2023.0,Questionable,MEXICO,Quintana Roo,CancÃºn,Swimming,Dillon Armijo,M,10,...,N,NaN,Authorities report injury caused bya barracuda,"Denver7, 3/29/2023",NaN,NaN,NaN,NaN,NaN,NaN
2,2022-12-30,2022.0,Provoked,South Africa,KNZ,Protea Banks,Diving/Shark Feeding,Ranier Kruger,M,26,...,N,09h00,Blacktip,"A Currie, GSAF",NaN,NaN,NaN,NaN,NaN,NaN
3,2022-07-16,2022.0,Unprovoked,USA,Florida,"Daytona Beach Shores, Volusia County",NaN,Tasa Summers,F,40.0,...,N,13h12,A small shark,"WESH, 717,2022",2022.07.16-Summers.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2022.07.16,2022.07.16,6785.0
4,2022-07-01,2022.0,Unprovoked,EGYPT,"Hurghada, Red Sea Governorate",Sahl Hasheesh,Swimming,Elisabeth Sauer,F,68.0,...,Y,NaN,"Oceaniic whitetip shark/tiger shark, 2m shark","M. Michaeilson, GSAF",2022.07.01.a-Sauer.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2022.07.01.a,2022.07.01.a,6775.0

In [208]:
df_t.Country.dropna().apply(lambda x: x.lower().replace(' ', '_')).unique()

array(['usa', 'mexico', 'south_africa', 'egypt', 'brazil', 'australia',
       'spain', 'thailand', 'mauritius', 'reunion', 'canada', 'fiji',
       'samoa', 'guam', 'panama', 'vietnam', 'ecuador', 'new_caledonia',
       'vanuatu', 'new_zealand', 'bahamas', 'japan', 'bermuda',
       'philippines', 'south_korea', 'sri_lanka', 'italy',
       'papua_new_guinea', 'mid_atlantic_ocean', 'maldive_islands',
       'solomon_islands', 'hong_kong', 'croatia', 'martinique',
       'singapore', 'tanzania', 'iran', 'southwest_pacific_ocean',
       'atlantic_ocean', 'south_atlantic_ocean', 'turkey', 'kuwait',
       'yemen', 'cuba', 'pacific_ocean', 'syria', 'india', 'england',
       'jamaica', 'belize', 'united_arab_emirates_(uae)',
       'united_kingdom', 'somalia', 'dominican_republic',
       'french_polynesia', 'tonga', 'mayotte', 'columbia', 'iraq',
       'china', 'libya', 'nigeria', 'mozambique', 'greece', 'israel',
       'scotland', 'seychelles', 'okinawa', 'chile', 'indonesia',
       'sudan?', 'sudan', 'costa_rica', 'nicaragua', 'lebanon',
       'andaman_islands', 'tobago', 'kenya', 'ceylon_(sri_lanka)',
       'france', 'egypt_/_israel', 'caribbean_sea', 'taiwan',
       'north_pacific_ocean', 'iran_/_iraq', 'java', 'barbados',
       'north_atlantic_ocean', 'malta', 'new_guinea', 'saudi_arabia',
       'madagascar', 'malaysia', 'gulf_of_aden', 'british_west_indies',
       'south_pacific_ocean', 'italy_/_croatia', 'montenegro',
       'cook_islands', 'west_indies', 'maldives', 'reunion_island',
       'st._martin', 'sierra_leone', 'mid-pacifc_ocean', 'persian_gulf',
       'honduras', 'uruguay', 'tasman_sea', 'guinea', 'korea',
       'cape_verde', 'united_arab_emirates', 'nevis', 'venezuela',
       'turks_&_caicos', 'marshall_islands', 'el_salvador', 'micronesia',
       'new_britain', 'senegal', 'azores', 'indian_ocean', 'peru',
       'turks_and_caicos', 'american_samoa', 'solomon_islands_/_vanuatu',
       'guyana', 'indian_ocean?', 'norway', 'antigua',
       'mediterranean_sea', 'burma', 'british_overseas_territory',
       'st_helena,_british_overseas_territory', 'portugal',
       'red_sea_/_indian_ocean', 'diego_garcia', 'south_china_sea',
       'bay_of_bengal', 'crete', 'ceylon', 'puerto_rico',
       'trinidad_&_tobago', 'tunisia', 'british_isles', 'grenada',
       'liberia', 'namibia', 'asia?', 'ireland', 'cayman_islands',
       'kiribati', 'argentina', 'guatemala', 'africa', 'russia',
       'colombia', 'comoros', 'aruba', 'british_virgin_islands',
       'northern_arabian_sea', 'palau', 'gabon', 'falkland_islands',
       'bahrein', 'federated_states_of_micronesia',
       'netherlands_antilles', 'cyprus', 'haiti', 'algeria', 'bangladesh',
       'johnston_island', 'northern_mariana_islands', 'greenland',
       'st_kitts_/_nevis', 'the_balkans', 'san_domingo', 'red_sea?',
       'curacao', 'paraguay', 'st._maartin', 'north_sea',
       'british_new_guinea', 'sweden', 'iceland', 'angola',
       'central_pacific', 'tuvalu', 'equatorial_guinea_/_cameroon',
       'between_portugal_&_india', 'djibouti', 'st_martin', 'ocean',
       'red_sea', 'admiralty_islands', 'andaman_/_nicobar_islandas',
       'slovenia', 'grand_cayman', 'jordan', 'monaco', 'ghana',
       'palestinian_territories', 'georgia', 'coast_of_africa',
       'western_samoa', 'roatan'], dtype=object)

In [202]:
dictio = {'South Africa': 'SF', 'SOUTH AFRICA': 'SF'}


df_t.Country.map(dictio).unique()

array([nan, 'SF'], dtype=object)

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Cleaning-Data" data-toc-modified-id="Cleaning-Data-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Cleaning Data</a></span><ul class="toc-item"><li><span><a href="#Null-values" data-toc-modified-id="Null-values-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Null values</a></span><ul class="toc-item"><li><span><a href="#Cleaning-Null-Values" data-toc-modified-id="Cleaning-Null-Values-1.1.1"><span class="toc-item-num">1.1.1&nbsp;&nbsp;</span>Cleaning Null Values</a></span></li><li><span><a href="#Checking-for-Null-Values" data-toc-modified-id="Checking-for-Null-Values-1.1.2"><span class="toc-item-num">1.1.2&nbsp;&nbsp;</span>Checking for Null Values</a></span></li><li><span><a href="#Dropping-Null-Values" data-toc-modified-id="Dropping-Null-Values-1.1.3"><span class="toc-item-num">1.1.3&nbsp;&nbsp;</span>Dropping Null Values</a></span></li><li><span><a href="#Filling-Null-Values" data-toc-modified-id="Filling-Null-Values-1.1.4"><span class="toc-item-num">1.1.4&nbsp;&nbsp;</span>Filling Null Values</a></span></li><li><span><a href="#ðŸ’¡-Check-for-understanding" data-toc-modified-id="ðŸ’¡-Check-for-understanding-1.1.5"><span class="toc-item-num">1.1.5&nbsp;&nbsp;</span>ðŸ’¡ Check for understanding</a></span></li></ul></li><li><span><a href="#Dealing-with-Duplicates" data-toc-modified-id="Dealing-with-Duplicates-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Dealing with Duplicates</a></span><ul class="toc-item"><li><span><a href="#Identifying-Duplicates" data-toc-modified-id="Identifying-Duplicates-1.2.1"><span class="toc-item-num">1.2.1&nbsp;&nbsp;</span>Identifying Duplicates</a></span></li><li><span><a href="#Removing-Duplicates" data-toc-modified-id="Removing-Duplicates-1.2.2"><span class="toc-item-num">1.2.2&nbsp;&nbsp;</span>Removing Duplicates</a></span></li><li><span><a href="#Removing-Duplicates-Based-on-Specific-Columns" data-toc-modified-id="Removing-Duplicates-Based-on-Specific-Columns-1.2.3"><span class="toc-item-num">1.2.3&nbsp;&nbsp;</span>Removing Duplicates Based on Specific Columns</a></span></li><li><span><a href="#Resetting-the-Index" data-toc-modified-id="Resetting-the-Index-1.2.4"><span class="toc-item-num">1.2.4&nbsp;&nbsp;</span>Resetting the Index</a></span></li></ul></li><li><span><a href="#Formatting-Data" data-toc-modified-id="Formatting-Data-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Formatting Data</a></span><ul class="toc-item"><li><span><a href="#Formatting-Numeric-Values" data-toc-modified-id="Formatting-Numeric-Values-1.3.1"><span class="toc-item-num">1.3.1&nbsp;&nbsp;</span>Formatting Numeric Values</a></span></li><li><span><a href="#Formatting-Strings" data-toc-modified-id="Formatting-Strings-1.3.2"><span class="toc-item-num">1.3.2&nbsp;&nbsp;</span>Formatting Strings</a></span></li><li><span><a href="#Formatting-Dates" data-toc-modified-id="Formatting-Dates-1.3.3"><span class="toc-item-num">1.3.3&nbsp;&nbsp;</span>Formatting Dates</a></span></li></ul></li><li><span><a href="#Cleaning-Column-Names" data-toc-modified-id="Cleaning-Column-Names-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Cleaning Column Names</a></span></li></ul></li><li><span><a href="#Using-apply(),-map(),-and-applymap()" data-toc-modified-id="Using-apply(),-map(),-and-applymap()-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Using <code>apply()</code>, <code>map()</code>, and <code>applymap()</code></a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Apply()" data-toc-modified-id="Apply()-2.0.1"><span class="toc-item-num">2.0.1&nbsp;&nbsp;</span><code>Apply()</code></a></span></li><li><span><a href="#Map()" data-toc-modified-id="Map()-2.0.2"><span class="toc-item-num">2.0.2&nbsp;&nbsp;</span><code>Map()</code></a></span></li><li><span><a href="#applyMap()" data-toc-modified-id="applyMap()-2.0.3"><span class="toc-item-num">2.0.3&nbsp;&nbsp;</span><code>applyMap()</code></a></span></li><li><span><a href="#More-examples" data-toc-modified-id="More-examples-2.0.4"><span class="toc-item-num">2.0.4&nbsp;&nbsp;</span>More examples</a></span><ul class="toc-item"><li><span><a href="#Comparing-Map-and-Apply" data-toc-modified-id="Comparing-Map-and-Apply-2.0.4.1"><span class="toc-item-num">2.0.4.1&nbsp;&nbsp;</span>Comparing Map and Apply</a></span></li><li><span><a href="#Calculating-the-length-of-the-name" data-toc-modified-id="Calculating-the-length-of-the-name-2.0.4.2"><span class="toc-item-num">2.0.4.2&nbsp;&nbsp;</span>Calculating the length of the name</a></span></li><li><span><a href="#Converting-to-float-some-columns-with-applymap()" data-toc-modified-id="Converting-to-float-some-columns-with-applymap()-2.0.4.3"><span class="toc-item-num">2.0.4.3&nbsp;&nbsp;</span>Converting to float some columns with applymap()</a></span></li><li><span><a href="#Modifying-cloumns-names-with-apply()" data-toc-modified-id="Modifying-cloumns-names-with-apply()-2.0.4.4"><span class="toc-item-num">2.0.4.4&nbsp;&nbsp;</span>Modifying cloumns names with apply()</a></span></li></ul></li><li><span><a href="#ðŸ’¡-Check-for-understanding" data-toc-modified-id="ðŸ’¡-Check-for-understanding-2.0.5"><span class="toc-item-num">2.0.5&nbsp;&nbsp;</span>ðŸ’¡ Check for understanding</a></span></li><li><span><a href="#ðŸ’¡-Check-for-understanding" data-toc-modified-id="ðŸ’¡-Check-for-understanding-2.0.6"><span class="toc-item-num">2.0.6&nbsp;&nbsp;</span>ðŸ’¡ Check for understanding</a></span></li></ul></li></ul></li><li><span><a href="#Filtering-Data" data-toc-modified-id="Filtering-Data-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Filtering Data</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Creating-a-condition" data-toc-modified-id="Creating-a-condition-3.0.1"><span class="toc-item-num">3.0.1&nbsp;&nbsp;</span>Creating a condition</a></span></li><li><span><a href="#Filtering-df" data-toc-modified-id="Filtering-df-3.0.2"><span class="toc-item-num">3.0.2&nbsp;&nbsp;</span>Filtering df</a></span></li><li><span><a href="#Using-multiple-conditions" data-toc-modified-id="Using-multiple-conditions-3.0.3"><span class="toc-item-num">3.0.3&nbsp;&nbsp;</span>Using multiple conditions</a></span></li></ul></li></ul></li><li><span><a href="#More-Data-Manipulation" data-toc-modified-id="More-Data-Manipulation-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>More Data Manipulation</a></span><ul class="toc-item"><li><span><a href="#Setting-the-index" data-toc-modified-id="Setting-the-index-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Setting the index</a></span></li><li><span><a href="#Adding/removing-rows-and/or-columns" data-toc-modified-id="Adding/removing-rows-and/or-columns-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Adding/removing rows and/or columns</a></span></li><li><span><a href="#ðŸ’¡-Check-for-understanding" data-toc-modified-id="ðŸ’¡-Check-for-understanding-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>ðŸ’¡ Check for understanding</a></span></li></ul></li><li><span><a href="#Summary" data-toc-modified-id="Summary-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Summary</a></span></li></ul></div>

# Cleaning Data

## Null values

Null values (also known as missing values) are common in datasets and can hinder data analysis and modeling. It is essential to handle null values appropriately to ensure accurate and reliable results. Pandas provides various methods to clean and handle null values in datasets.

In Python, `None` is a special constant that represents the absence of a value. It is commonly used to indicate that a variable or function has no value or hasn't been assigned any value. For example, if a function does not explicitly return a value, it implicitly returns `None`.

On the other hand, `NaN` stands for "Not a Number" and is a special value used to represent missing or undefined numerical data. `NaN` is part of the floating-point representation and is commonly used in numeric data structures like Pandas DataFrames and Series to indicate missing or invalid numerical values.

In [14]:
import numpy as np

np.nan

nan

In [15]:
type(np.nan)

float



### Cleaning Null Values

1. Checking for Null Values:
   - Use `isnull()` method to check for null values in a DataFrame or Series.
   - Use `notnull()` method to check for non-null values in a DataFrame or Series.

2. Dropping Null Values:
   - Use `dropna()` method to remove rows with null values from a DataFrame.
   - Use `dropna(axis=1)` to remove columns with null values.

3. Filling Null Values:
   - Use `fillna(value)` method to replace null values with a specific value.
   - Use `fillna(method='ffill')` to forward-fill null values with the previous non-null value.
   - Use `fillna(method='bfill')` to backward-fill null values with the next non-null value.

### Checking for Null Values

In [17]:
import pandas as pd

# Load Titanic dataset from an online source
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/titanic_train.csv'


df = pd.read_csv(url)

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

When working with large datasets, using `isna()` or `isnull()` along with `any()` and `sum()` in Pandas becomes essential for quick and efficient data quality assessment.

In [19]:
df.isna().head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False

In [20]:
df.isnull().head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False

In [21]:
df.notna().head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,True,True,True,True,True,True,True,True,True,True,False,True
1,True,True,True,True,True,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True,True,True,True,False,True
3,True,True,True,True,True,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True,True,True,True,False,True

sum() calculates the sum of each row, considering True as 1 and False as 0.

In [22]:
df.isna().any()  # Â¿hay nulos en esa columna?

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [23]:
df.isna().all()    # Â¿son todos nulos en esa columna?

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age            False
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin          False
Embarked       False
dtype: bool

In [25]:
df.T.isna().any().head()   # Â¿hay nulos en esa fila?

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [31]:
df.isna().any(axis=1).head()   # Â¿hay nulos en esa fila?

0     True
1    False
2     True
3    False
4     True
dtype: bool

If we add the parameter `axis=1` with the `sum()` function, we can calculate the sum of each row (along the columns) of the DataFrame `df`. This results in a Series that contains the count of null values in each row.

In [27]:
df.isna().sum()   # Â¿cuantos nulos hay en esa columna?

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [29]:
df.isna().sum(axis=0)  # Â¿cuantos nulos hay en esa columna?

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [32]:
df.isna().sum(axis=1).head()  # Â¿cuantos nulos hay en esa fila?

0    1
1    0
2    1
3    0
4    1
dtype: int64

### Dropping Null Values

In [34]:
df.dropna().head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

In [36]:
df.dropna(axis=0).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

In [37]:
df.dropna(axis=1).head()  # hasta luegui columnas

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000
4,5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500

However, as we can see below in the DataFrame, the rows with NaN values have not been removed. To execute the change, it is necessary to use the `inplace=True` option: `df.dropna(inplace=True)` or assign it to a variable such as df = df.dropna().

In [38]:
nan_cols = df.isna().sum()

nan_cols[nan_cols>0]

Age         177
Cabin       687
Embarked      2
dtype: int64

In the `dropna()` method of Pandas DataFrame, the `subset`, `how`, and `thresh` parameters are used to control the behavior of dropping rows or columns containing NaN (null) values, when we don't want to drop them just because they have *one* null value:

- `subset`: It allows you to specify a subset of columns on which to apply the `dropna()` operation. Only the rows containing NaN values in the specified subset of columns will be dropped.

In [39]:
df.dropna(subset=['Age', 'Cabin']).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

In [42]:
df.dropna(subset=['Age']).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [43]:
df.dropna(subset=['Age']).isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          529
Embarked         2
dtype: int64

In [44]:
df.drop(columns=['Age']).head()

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500,NaN,S

In [46]:
#help(df.dropna)

- `how`: It specifies the condition for dropping rows. It can take the values 'any', which means to drop rows containing any NaN values in the `subset`, or 'all', which means to drop rows containing all NaN values in the `subset`.

In [48]:
df.dropna(how='all').head()  # si y solo si todo es nulos (axis=0 o axis=1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [49]:
df.dropna(how='all', axis=0).head()  # si y solo si todo es nulos (axis=0 o axis=1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

- `thresh`: It sets a minimum threshold for the number of non-null values that a row must have in the `subset` in order to be kept. Rows with fewer non-null values than the specified threshold will be dropped.

In [52]:
df.dropna(thresh=2, axis=0).tail()  # si y solo si todo es nulos (axis=0 o axis=1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [55]:
df.dropna(thresh=2, axis=0).shape

(891, 12)

In [56]:
df.shape

(891, 12)

In [58]:
df.reset_index().head()

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [59]:
df.reset_index(drop=True).head()  # drop=True dice no generes la columna index

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [60]:
df.dropna().shape

(183, 12)

In [62]:
df.dropna().head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

In [63]:
df.dropna().reset_index().head()

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
1,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
2,6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
3,10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
4,11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

### Filling Null Values

`fillna()` is a Pandas method used to replace NaN (null) values in a DataFrame or Series with specified values.
- You can use `inplace=True` to modify the DataFrame directly.

In [65]:
df.fillna('hola').head()   # rellena todos los nulos de df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,hola,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,hola,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,hola,S

Careful if we assign a different data type, since Pandas will change the data type of the whole column. For example:

In [72]:
df.Age.fillna(0).tail()

886    27.0
887    19.0
888     0.0
889    26.0
890    32.0
Name: Age, dtype: float64

In [71]:
df.Age.fillna(df.Age.mean()).tail()

886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, dtype: float64

In [73]:
df.Age.fillna(df.Age.median()).tail()

886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: Age, dtype: float64

In [75]:
df.Age.mean()

29.69911764705882

In [74]:
df.Age.fillna(df.Age.mean()).mean()

29.69911764705882

In [76]:
df.Age.fillna(df.Age.median()).mean()

29.36158249158249

To avoid this, we can select manually in which column to apply the `fillna()`

In [79]:
df.Cabin.fillna('unknown').head()

0    unknown
1        C85
2    unknown
3       C123
4    unknown
Name: Cabin, dtype: object

We can also use the mean(), median() etc. to fill the null values.

- Two common methods for filling NaN values are `ffill`, which forward fills using the last valid value, and `bfill`, which backward fills using the next valid value.

In [81]:
df.Age.fillna(method='ffill').tail()

886    27.0
887    19.0
888    19.0
889    26.0
890    32.0
Name: Age, dtype: float64

In [82]:
df.Age.fillna(method='bfill').tail()

886    27.0
887    19.0
888    26.0
889    26.0
890    32.0
Name: Age, dtype: float64

In [83]:
df.Age.tail()

886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, dtype: float64

In [86]:
df.Cabin.fillna(method='bfill').head()

0     C85
1     C85
2    C123
3    C123
4     E46
Name: Cabin, dtype: object

In [87]:
df.Cabin.head()

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: Cabin, dtype: object

## Dealing with Duplicates

In data analysis, it's common to encounter duplicate values in datasets. Duplicates can distort our analysis and lead to incorrect conclusions. Fortunately, pandas provides efficient methods to handle duplicates.

### Identifying Duplicates

To identify duplicate rows in a DataFrame, we can use the `duplicated()` method, which returns a boolean Series indicating whether each row is a duplicate or not. We can then use the `sum()` method to count the total number of duplicates.

In [89]:
df.duplicated().any()

False

In [90]:
df.duplicated().sum()

0

To check for duplicates in specific columns, we can use the `duplicated()` method with the `subset` parameter, or just access first to the column and then check with duplicated().

In [92]:
df.duplicated(subset=['Age', 'Cabin']).sum()

607

In [96]:
df[df.duplicated(subset=['Age', 'Cabin'])].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S

In [94]:
df[df.Age==14]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
39,40,1,3,"Nicola-Yarred, Miss. Jamila",female,14.0,1,0,2651,11.2417,NaN,C
435,436,1,1,"Carter, Miss. Lucile Polk",female,14.0,1,2,113760,120.0000,B96 B98,S
683,684,0,3,"Goodwin, Mr. Charles Edward",male,14.0,5,2,CA 2144,46.9000,NaN,S
686,687,0,3,"Panula, Mr. Jaako Arnold",male,14.0,4,1,3101295,39.6875,NaN,S

In [100]:
df[(df.Age.isna()) & (df.Cabin.isna())].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q

### Removing Duplicates

To remove duplicates from a DataFrame, we can use the `drop_duplicates()` method. By default, this method keeps the first occurrence of each duplicated row and removes the rest.

In [102]:
df.drop_duplicates(inplace=True)

### Removing Duplicates Based on Specific Columns

Sometimes, we may want to remove duplicates based on specific columns. We can pass a subset of column names to the `drop_duplicates()` method to achieve this.

In [104]:
# drop_duplicates borra filas duplicadas, y deja la primera por defecto

df.drop_duplicates(subset=['Age', 'Cabin']).head(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
22,23,1,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S

By default, `drop_duplicates()` keeps the first occurrence of each duplicated row. If we want to keep the last occurrence instead, we can set the `keep` parameter to `'last'`.

In [106]:
# aqui se deja la ultima fila duplicada y el resto se elimina

df.drop_duplicates(keep='last', subset=['Age', 'Cabin']).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

### Resetting the Index

When removing duplicates, the DataFrame index may have gaps due to removed rows. To reset the index after removing duplicates, we can use the `reset_index()` method with the `drop=True` parameter.

In [111]:
# resetea el indice de 0 a N siendo N=len(df)

df.dropna().reset_index().head()

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
1,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
2,6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
3,10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
4,11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

In [115]:
%%time

len(df)  # nÂº de filas

CPU times: user 15 Âµs, sys: 0 ns, total: 15 Âµs
Wall time: 24.1 Âµs

891

In [116]:
%%time

df.shape  # esto ya esta calculado a priori, esto va mÃ¡s rÃ¡pido

CPU times: user 18 Âµs, sys: 1e+03 ns, total: 19 Âµs
Wall time: 22.2 Âµs

(891, 12)

In [112]:
df.dropna().reset_index(drop=True).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
1,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
2,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
3,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
4,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

## Formatting Data

### Formatting Numeric Values


1. `round()` Method:
   - Rounds numeric values to a specified number of decimal places.

2. `format()` Method:
   - Formats numeric values as strings for better representation.

In [124]:
num = 93785.03928743657836

In [127]:
round(num, 3)

93785.039

In [126]:
format(num, '.3f')

'93785.039'

### Formatting Strings

Check the data structures lesson for more string operations and formatting. Here we'll just look at some of them.

1. **Using f-strings (formatted string literals):**
   - f-strings are introduced in Python 3.6 and provide a concise and readable way to format strings.
   - Place variables or expressions inside curly braces `{}` in the string, preceded by the `f` character.

In [129]:
nombre = 'Yo'

f'Hola {nombre}, el numero es {num}'

'Hola Yo, el numero es 93785.03928743658'

2. **Using the `format()` method:**
   - The `format()` method can be applied to a string and accepts positional or keyword arguments to replace placeholders.
   - Placeholders are represented by curly braces `{}` and can be indexed or named.

In [130]:
'Hola {}, el numero es {}'.format(nombre, num)

'Hola Yo, el numero es 93785.03928743658'

3. **Using `%` formatting:**
   - `%` formatting is an older method, similar to C-style formatting, but less recommended due to its limitations and lack of flexibility.
   - Placeholders are represented by `%` followed by format specifiers, like `%s` for strings and `%d` for integers.

In [136]:
'Hola %s, el numero es %d' % (nombre, num)

'Hola Yo, el numero es 93785'

Let's look at some methods for formatting strings.

In [137]:
print 8

SyntaxError: Missing parentheses in call to 'print'. Did you mean print(8)? (3424560664.py, line 1)

### Formatting Dates

We will study this in another Notebook.

## Cleaning Column Names

We can acccess the columns using `df.columns`

In [146]:
df.columns = df.columns.str.lower()

df.columns = df.columns.str.replace('p', 'o')

df.columns

Index(['oassengerid', 'survived', 'oclass', 'name', 'sex', 'age', 'sibso',
       'oarch', 'ticket', 'fare', 'cabin', 'embarked'],
      dtype='object')

In [144]:
df.columns.str.contains('pa')

array([ True, False, False, False, False, False, False,  True, False,
       False, False, False])

In [149]:
df.name.str.lower().head()

0                              braund, mr. owen harris
1    cumings, mrs. john bradley (florence briggs th...
2                               heikkinen, miss. laina
3         futrelle, mrs. jacques heath (lily may peel)
4                             allen, mr. william henry
Name: name, dtype: object

In [151]:
num = 3

num.replace()

AttributeError: 'int' object has no attribute 'replace'

In order to modify them, we can assign new column names to `df.columns` by doing `df.columns = [list_of_new_column_names]` or we can use the `rename()` method to just modify a few of them.

In [154]:
df.rename(columns={'sex': 'gender'}, inplace=True)

In [155]:
df.head()

,oassengerid,survived,oclass,name,gender,age,sibso,oarch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Using `apply()`, `map()`, and `applymap()`

- `apply()`
    - Apply a custom function to a Series.
    - Useful for element-wise transformations.
    - Example: `df['squared_numbers'] = df['numbers'].apply(lambda x: x ** 2)`

- `map()`
    - Transform Series elements based on a dictionary.
    - Replaces elements with corresponding dictionary values.
    - Example: `df['gender_mapped'] = df['gender'].map({'M': 'Male', 'F': 'Female'})`

- `applymap()`
    - Apply a custom function to every element in a DataFrame.
    - Useful for element-wise transformations on entire DataFrames.
    - Example: `df = df.applymap(lambda x: x.upper())`

###Â `Apply()`

In [158]:
df.dropna(inplace=True)

In [161]:
fecha = 2024 - 1912

fecha

112

In [162]:
def cambiar_edad(edad):
    
    global fecha
    
    return edad+fecha

In [163]:
cambiar_edad(38)

150

In [165]:
%%time

df.age.apply(cambiar_edad).head()

CPU times: user 1.08 ms, sys: 30 Âµs, total: 1.11 ms
Wall time: 1.1 ms

1     150.0
3     147.0
6     166.0
10    116.0
11    170.0
Name: age, dtype: float64

In [168]:
df.age.apply(lambda x: x+fecha).head()

1     150.0
3     147.0
6     166.0
10    116.0
11    170.0
Name: age, dtype: float64

In [173]:
list(df.age.items())[:10]

[(1, 38.0),
 (3, 35.0),
 (6, 54.0),
 (10, 4.0),
 (11, 58.0),
 (21, 34.0),
 (23, 28.0),
 (27, 19.0),
 (52, 49.0),
 (54, 65.0)]

In [175]:
%%time


(df.age + 112).head()

CPU times: user 404 Âµs, sys: 1 Âµs, total: 405 Âµs
Wall time: 409 Âµs

1     150.0
3     147.0
6     166.0
10    116.0
11    170.0
Name: age, dtype: float64

In the example above, we can see that to create a new column in pandas, we can simply assign a new Series or list to a new column name within the DataFrame.

To edit the information in a whole column in pandas, you can simply assign a new list or array of values to the column you want to modify.

###Â `Map()`

In [185]:
transformar_genero = {0: 'male', 1:'female'}  # la key es lo que hay, el value es lo que quiero

(df.gender.map(transformar_genero)).head()

1     female
3     female
6       male
10    female
11    female
Name: gender, dtype: object

In [186]:
df.gender.unique()

array([1, 0])

In [187]:
df.gender.map(transformar_genero, inplace=True)

TypeError: map() got an unexpected keyword argument 'inplace'

In [188]:
df.gender = df.gender.map(transformar_genero)

In [189]:
df.head()

,oassengerid,survived,oclass,name,gender,age,sibso,oarch,ticket,fare,cabin,embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

In [194]:
df.loc[889, 'gender'] = 'macho'

In [195]:
df.tail()

,oassengerid,survived,oclass,name,gender,age,sibso,oarch,ticket,fare,cabin,embarked
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",macho,26.0,0,0,111369,30.0000,C148,C

In [196]:
transformar_genero = {'male':0, 'macho': 0, 'female': 1}

df.gender = df.gender.map(transformar_genero)

In [197]:
df.tail()

,oassengerid,survived,oclass,name,gender,age,sibso,oarch,ticket,fare,cabin,embarked
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",1,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",0,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",1,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",1,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",0,26.0,0,0,111369,30.0000,C148,C

###Â `applyMap()`

In [213]:
# applymap es para todo el df

# isinstance se refiere a una copia de la clase, en este caso que sea string

df.applymap(lambda x: x.upper() if isinstance(x, str) else x).head()

,oassengerid,survived,oclass,name,gender,age,sibso,oarch,ticket,fare,cabin,embarked
1,2,1,1,"CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...",1,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)",1,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"MCCARTHY, MR. TIMOTHY J",0,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"SANDSTROM, MISS. MARGUERITE RUT",1,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"BONNELL, MISS. ELIZABETH",1,58.0,0,0,113783,26.5500,C103,S

In [217]:
df.applymap(lambda x: x.capitalize() if type(x)==str else x).head()

,oassengerid,survived,oclass,name,gender,age,sibso,oarch,ticket,fare,cabin,embarked
1,2,1,1,"Cumings, mrs. john bradley (florence briggs th...",1,38.0,1,0,Pc 17599,71.2833,C85,C
3,4,1,1,"Futrelle, mrs. jacques heath (lily may peel)",1,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"Mccarthy, mr. timothy j",0,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, miss. marguerite rut",1,4.0,1,1,Pp 9549,16.7000,G6,S
11,12,1,1,"Bonnell, miss. elizabeth",1,58.0,0,0,113783,26.5500,C103,S

### More examples

#### Comparing Map and Apply

We have a column called "Embarked" containing three possible values: 'C', 'Q', and 'S'. We want to map these values to 0, 1 and 2. In this case, `apply()` with a lambda function would be complex due to the if-elif-else conditions, but `map()` can handle it more easily.

Why is it a float?

#### Calculating the length of the name

What if we wanted to create a new column with the length of the name?

#### Converting to float some columns with applymap()

Lets look just as an example, how to make float all the following columns: "PassengerId", "Survived", "Pclass"

#### Modifying cloumns names with apply()

# Filtering Data

One of the primary tasks in dataset analysis is filtering rows.

When filtering DataFrames in Pandas, you can use boolean indexing to select specific rows based on certain conditions. Here's a step-by-step explanation:

1. Identify the column(s) you want to use as a filter condition. For example, in `housing_df` the column named 'SalePrice'.

2. Create a condition using a comparison operator (e.g., `>`, `<`, `==`, etc.) and the column(s) you want to filter. For instance, to filter all rows where the 'SalePrice' is greater than 10000, you would use `condition = housing_df['SalePrice'] > 10000`.

3. Use the condition to filter the DataFrame. You can do this by passing the condition inside square brackets to the DataFrame. For example, `filtered_df = housing_df[condition]` will create a new DataFrame `filtered_df` containing only the rows where the 'SalePrice' is greater than 10000.

Keep in mind that the condition should evaluate to a boolean Series with the same length as the DataFrame, indicating which rows to include (True) or exclude (False).

You can also combine multiple conditions using logical operators like `&` for 'and' and `|` for 'or'. For instance, to filter rows where the 'SalePrice' is greater than 10000 and the 'FullBath' is more than 1, you can use `condition = (housing_df['SalePrice'] > 10000) & (housing_df['FullBath'] > 1)`.

Filtering allows you to extract specific subsets of data from your DataFrame, making it easier to analyze and work with the data that meets your criteria.

### Creating a condition

### Filtering df

### Using multiple conditions

# More Data Manipulation

## Setting the index

To set an index in pandas, you can use the `set_index()` method of the DataFrame. This method allows you to specify which column you want to use as the index for the DataFrame.

## Adding/removing rows and/or columns

To add or remove rows and/or columns from a pandas DataFrame, you can use the following methods:

1. Adding rows:
   - Use the `append()` method to add rows to the DataFrame.

2. Removing rows:
   - Use the `drop()` method with the row index or label to remove specific rows.

3. Adding columns:
   - Using `df[new_column]`, you simply assign a list, Series, or scalar value to the new column name
   - Assign a new column to the DataFrame using bracket notation or the `assign()` method.

4. Removing columns:
   - Use the `drop()` method with the column name and `axis=1` to remove specific columns.
   - Alternatively, you can use the `del` keyword to remove a column in-place.

# Summary

1. Null Values:
   - Null values (also known as missing values) can hinder data analysis and modeling.
   - Use `isnull()` or `isna()` to check for null values in a DataFrame or Series.
   - Use `any()` and `sum()` to efficiently assess data quality.
   - Use `dropna()` to remove rows or columns with null values from a DataFrame.
   - Parameters like subset, how, and thresh can control the behavior of dropping rows or columns.
   - Use `fillna()` to replace null values with specific values, such as `mean()`, `median()`, or forward/backward fill.

5. Formatting Data:
   - Use `round()` and `format()` to format numeric values.
   - Use f-strings, `format()` or % to format strings and use string methods like `lower()`, `upper()`, `title()`, `strip()`, `split()`, and `replace()`.

6. Cleaning Column Names:
   - Use df.columns to access column names.
   - Modify column names using df.columns or `rename()`.

7. Using `apply()`, `map()`, and `applymap()`:
   - `apply()`: Applies a custom function to a Series.
   - `map()`: Transforms Series elements based on a dictionary.
   - `applymap()`: Applies a custom function to every element in a DataFrame.

8. Filtering Data:
   - Filter rows in a DataFrame using boolean indexing.
   - Use comparison operators (<, >, ==) to create conditions.
   - Combine multiple conditions using logical operators (& for 'and', | for 'or').

9. Setting the Index:
   - Use `set_index()` to set an index for the DataFrame.

10. Adding/Removing Rows and Columns:
   - Use `append()` to add rows to the DataFrame.
   - Use `drop()` with the row index/label to remove specific rows.
   - Use bracket notation, `assign()`, or `drop()` with axis=1 to add/remove columns.

In [218]:
import funciones

In [219]:
funciones

In [220]:
help(funciones)

Help on module funciones:

NAME
    funciones

FUNCTIONS
    multi_2(x)
        Aqui multiplicar

    sumar_24(x)
        Aqui sumar

FILE
    /Users/iudh/apuntes_clase/semana_2/funciones.py

In [221]:
funciones.sumar_24(8)   # paquete.funcion

32

In [222]:
from funciones import multi_2

In [223]:
multi_2

In [224]:
multi_2(9)

18

In [225]:
sumar_24

NameError: name 'sumar_24' is not defined

In [226]:
from funciones import *

In [227]:
sumar_24

In [228]:
sumar_24(8)

32

In [229]:
import funciones as f

In [230]:
f.sumar_24(8)

32

In [231]:
import pandas as pd

In [232]:
from pandas import *

In [233]:
DataFrame

pandas.core.frame.DataFrame

In [234]:
DataFrame([1,2,3,4])

   0
0  1
1  2
2  3
3  4

In [235]:
from pandas import DataFrame as tabla

In [236]:
tabla([1,2,3,4])

   0
0  1
1  2
2  3
3  4

In [ ]:
help(tabla)